require_relative "conversion"
module Choices
include Conversion
    def converted_number
        if @amount.include?("適量") or @amount.include?("少々") or @amount.include?("ひとつまみ")
            @quantity = 1
        else    
            @converted_number = Rational(@amount.tr('〇一二三四五六七八九', '0123456789').tr('０-９ａ-ｚＡ-Ｚ／', '0-9a-zA-Z/').delete("^0-9/","^０-９／")).to_f
        end
    end

    def food_material
        case @temporary_food_id
            when "15" then
                conversion1
                #15:大根/本
            when "16","37","78","124" then
                #16:かぶ、37:なす、78:みかん、124:ぶり
                conversion2
            when "17" then
                #17:人参
                conversion3
            when "18","38","41","65","111","121","144","151","152","162" then 
                #18:ゴボウ、38:トマト、41:パプリカ、65:じゃが芋、111:あじ、121:さんま、
                #144:米、151:中華麺、152:焼きそば麺、162:かまぼこ
                conversion4
            when "21" then
                #21:白菜
                conversion5
            when "22","33","79","128" then
                #22:小松菜、33:レタス、79:りんご、128:いか
                conversion6
            when "23","54" then
                #23:キャベツ、54:かぼちゃ
                conversion7
            when "24","27","32","34","44","46","89" then 
                #24:ほうれん草、27:春菊、32:ブロッコリー、34:水菜、44:たまねぎ、89:ばなな、46:もやし
                conversion8
            when "25","28","29","36","45","49","50","53","91","112","113","114","116","117","118","119","120","122","161" then
                #25:ねぎ、28:にら、29:セロリ、36:きゅうり、45:にんにくの芽、49:えのき、50:しめじ、53:舞茸,
                #91:キウイ,112:たら,113:いわし,114:かじきまぐろ,116:かれい,117:鯛,118:鮭,119:さば,120:さわら,122:すずき,161:はんぺん
                conversion9
            when "26","61" then
                #26:みつば、61:里芋
                conversion10
            when "30","68","70" then 
                #30:アスパラガス、68:しょうが、70:みょうが
                conversion11
            when "31" then
                #31:カリフラワー
                conversion12
            when "39","52","55","168" then 
                #39:ミニトマト、52:マッシュルーム、55:いんげん、168:うずらの卵
                conversion13
            when "40","139" then 
                #40:ピーマン、139:ほたて貝
                conversion14
            when "42" then
                #42:とうもろこし
                conversion15
            when "43","66" then
                #43:おくら、66:ニンニク
                conversion16
            when "47" then
                #47:しいたけ
                conversion17
            when "51","178" then
                #51:エリンギ,178:納豆
                conversion18
            when "62","63" then
                #62:ながいも、63:山芋
                conversion19
            when "64","81","83" then
                #64:さつまいも、81:柿、83:桃
                conversion20
            when "71","72" then
                #71:おろしにんにく,72:おろししょうが
                conversion21
            when "73","142" then
                #73:唐辛子,142:海苔
                conversion22
            when "74","148","149" then 
                #74:ゆず,148:うどん、149:そば
                conversion23
            when "82","146" then
                #82:びわ、146:餅
                conversion24
            when "85","86","136","138","159","162" then 
                #85:くり、86:いちご、136:かき、138:はまぐり、159:油揚げ、162:ちくわ
                conversion25
            when "102","157","175" then
                #102:鶏もも肉,157:豆腐,175:こんにゃく
                conversion26
            when "103" then
                #103:鶏むね肉
                conversion27
            when "104","105","155" then 
                #155:食パン、104:手羽元、105:手羽先
                conversion28
            when "106" then
                #106:ささみ
                conversion29
            when "130" then
                #130:たこ
                conversion30
            when "132" then
                #132:えび
                conversion31
            when "145","158" then
                #145:もち米,158:厚揚げ
                conversion32
            when "164" then
                #164:ハム
                conversion33
            when "165","166" then
                #165:ウインナー,166:ベーコン
                conversion34
            when "167" then
                #167:卵
                conversion35
            when "176" then
                #176:白滝
                conversion36
            when "140","160","169","172","184","185","186","187","188","189","190","191","192","193","194","195","196","197","198","199",
                "200","201","202","203","204","205","206","207","208","209","210","211","212","213","214","215","216","217","218","219",
                "220","221","222","223","224","225","227"then
                #140:昆布,160:海苔,169:牛乳,172:生クリーム,184:薄口醤油~225:カレールー,227:水
                conversion37
            else
                #19:筍,20:蓮根
                #48:なめこ
                #56:えんどうまめ,57:グリンピース,58:そらまめ,59:えだ豆,60:小豆
                #67:わさび,69:しそ,75:パセリ,76:ローズマリー,77:バジル
                #80:なし,84:ぶどう,87:メロン,88:スイカ,90:パイナップル
                #92:牛薄切り肉,93:牛バラ肉,94:牛ブロック肉,95:牛挽き肉,96:豚薄切り肉,97:豚バラ肉,98:豚こま肉,99:豚ロース肉,100:豚ブロック肉,101:豚挽き肉,107:鶏挽き肉,108:鴨肉,109:ラム肉,110:合い挽き肉
                #115:かつお,123:ひらめ,125:まぐろ,126:かんぱち,127:サーモン
                #129:かに（かに缶）,131:うに,133:あなご,134:うなぎ,135:あさり,137:しじみ
                #141:わかめ,143:青海苔
                #147:白米,150:そうめん153:パスタ,154:マカロニ,156:シリアル
                #170:チーズ,171:ヨーグルト,173:クリームチーズ
                #174:麩,177:かんぴょう,179:餃子の皮,180:春巻きの皮,181:春雨,182:かつお節,183:天かす
                conversion38
        end
    end

  
end
